#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/deep-thought/iac-auth0/runs/run-AkJz1CYyEuBLfvkH

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # auth0_client.test_client will be created
  + resource "auth0_client" "test_client" {
      + app_type                            = "non_interactive"
      + client_id                           = (known after apply)
      + client_secret                       = (sensitive value)
      + custom_login_page_on                = (known after apply)
      + description                         = "Test Client"
      + grant_types                         = (known after apply)
      + id                                  = (known after apply)
      + is_first_party                      = (known after apply)
      + is_token_endpoint_ip_header_trusted = (known after apply)
      + name                                = "Test Client"
      + oidc_conformant                     = (known after apply)
      + signing_keys                        = (sensitive value)
      + token_endpoint_auth_method          = (known after apply)

      + addons {
          + aws                    = (known after apply)
          + azure_blob             = (known after apply)
          + azure_sb               = (known after apply)
          + box                    = (known after apply)
          + cloudbees              = (known after apply)
          + concur                 = (known after apply)
          + dropbox                = (known after apply)
          + echosign               = (known after apply)
          + egnyte                 = (known after apply)
          + firebase               = (known after apply)
          + layer                  = (known after apply)
          + mscrm                  = (known after apply)
          + newrelic               = (known after apply)
          + office365              = (known after apply)
          + rms                    = (known after apply)
          + salesforce             = (known after apply)
          + salesforce_api         = (known after apply)
          + salesforce_sandbox_api = (known after apply)
          + sap_api                = (known after apply)
          + sentry                 = (known after apply)
          + sharepoint             = (known after apply)
          + slack                  = (known after apply)
          + springcm               = (known after apply)
          + wams                   = (known after apply)
          + wsfed                  = (known after apply)
          + zendesk                = (known after apply)
          + zoom                   = (known after apply)

          + samlp {
              + audience                           = (known after apply)
              + authn_context_class_ref            = (known after apply)
              + binding                            = (known after apply)
              + create_upn_claim                   = (known after apply)
              + destination                        = (known after apply)
              + digest_algorithm                   = (known after apply)
              + include_attribute_name_format      = (known after apply)
              + issuer                             = (known after apply)
              + lifetime_in_seconds                = (known after apply)
              + logout                             = (known after apply)
              + map_identities                     = (known after apply)
              + map_unknown_claims_as_is           = (known after apply)
              + mappings                           = (known after apply)
              + name_identifier_format             = (known after apply)
              + name_identifier_probes             = (known after apply)
              + passthrough_claims_with_no_mapping = (known after apply)
              + recipient                          = (known after apply)
              + sign_response                      = (known after apply)
              + signature_algorithm                = (known after apply)
              + signing_cert                       = (known after apply)
              + typed_attributes                   = (known after apply)
            }
        }

      + jwt_configuration {
          + alg                 = (known after apply)
          + lifetime_in_seconds = (known after apply)
          + scopes              = (known after apply)
          + secret_encoded      = (known after apply)
        }

      + mobile {
          + android {
              + app_package_name         = (known after apply)
              + sha256_cert_fingerprints = (known after apply)
            }

          + ios {
              + app_bundle_identifier = (known after apply)
              + team_id               = (known after apply)
            }
        }

      + native_social_login {
          + apple {
              + enabled = (known after apply)
            }

          + facebook {
              + enabled = (known after apply)
            }
        }

      + refresh_token {
          + expiration_type              = (known after apply)
          + idle_token_lifetime          = (known after apply)
          + infinite_idle_token_lifetime = (known after apply)
          + infinite_token_lifetime      = (known after apply)
          + leeway                       = (known after apply)
          + rotation_type                = (known after apply)
          + token_lifetime               = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @hans-m-song, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*